from aiogram import Router, F
from aiogram.types import Message

router = Router()

@router.message(F.text.lower() == "☎️ полезные контакты")
async def contacts_info_handler(message: Message):
    text = (
        "<u>Управляющая компания:</u>\n"
        "<b>Диспетчерская служба ООО «УЭР-ЮГ»</b>\n"
        "+7 4722 35-50-06\n"
        "<b>Инженеры ООО «УЭР-ЮГ»</b>\n"
        "+7 920 566-28-86\n"
        "Бухгалтерия ООО «УЭР-ЮГ»\n"
        "+7 4722 35-50-06\n"
        "Белгород, Свято-Троицкий бр., д. 15, подъезд № 1\n\n"

        "<u>Телефоны для открытия ворот и шлагбаумов:</u>\n"
        "<b>Шлагбаум «Набережная»</b>\n"
        "+7 920 554-87-74\n"
        "<b>Ворота «Харьковские»</b>\n"
        "+7 920 554-87-40\n"
        "<b>Ворота «Мост»</b>\n"
        "+7 920 554-64-06\n"
        "<b>Калитка 1 «Мост»</b>\n"
        "+7 920 554-42-10\n"
        "<b>Калитка 2 «Мост»</b>\n"
        "+7 920 554-89-04\n"
        "<b>Калитка 3 «Харьковская»</b>\n"
        "+7 920 554-87-39\n"
        "<b>Калитка 4 «Харьковская»</b>\n"
        "+7 920 554-89-02\n\n"

        "<b>Охрана</b>\n"
        "+7 915 57-91-457\n\n"

        "<b>Участковый</b>\n"
        "Куленцова Марина Владимировна\n"
        "+7 999 421-53-72"
    )

    await message.answer(text, parse_mode="HTML")
